Revit 2027 API
IContextMenuCreator.BuildContextMenu Method
 Build a Context Menu.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
void BuildContextMenu(
	ContextMenu menu
)
Sub BuildContextMenu (
	menu As ContextMenu
)
void BuildContextMenu(
	ContextMenu^ menu
)
abstract BuildContextMenu :
        menu : ContextMenu -> unit
Parameters
menu ContextMenu
Remarks
 In this method, developer can add menu items to the passed in ContextMenu object. This callback will be called on every right-click in Canvas or ProjectBrowser.
See Also
Reference
IContextMenuCreator Interface
Autodesk.Revit.UI Namespace